# Samuel Allegretto
## Week 13 11/19/2020
### Python - Pandas DataFrame - Grouping and Mapping

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [2]:
df = DataFrame({'city':['Alma','Brian Head','Fox Park','Lake Mary'],
               'altitude':[10355,9800,9062,8966]})

df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [4]:
st_map={'Alma':'CO','Brian Head':'UT','Fox Park':'WY','Lake Mary':'CA'}
st_map

{'Alma': 'CO', 'Brian Head': 'UT', 'Fox Park': 'WY', 'Lake Mary': 'CA'}

In [5]:
df['state'] = df['city'].map(st_map)

df

         city  altitude state
0        Alma     10355    CO
1  Brian Head      9800    UT
2    Fox Park      9062    WY
3   Lake Mary      8966    CA

In [7]:
#Apply 
def meter(x):
    return x / 3.2808

In [8]:
df['altitude'] = df['altitude'].apply(meter)

df

         city     altitude state
0        Alma  3156.242380    CO
1  Brian Head  2987.076323    UT
2    Fox Park  2762.131188    WY
3   Lake Mary  2732.870032    CA

In [9]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'),
              index=['UT','OH','TX','OR'])

df

           b         d         e
UT -0.079023 -0.131377 -0.329277
OH -0.298520 -0.266721 -1.507252
TX -1.855996  1.059638 -0.005989
OR  0.359052  0.173159  0.239323

In [10]:
def dif(x):
    return x.max() - x.min()

In [11]:
df.apply(dif)

b    2.215048
d    1.326359
e    1.746575
dtype: float64

In [12]:
df.apply(dif,axis = 1)

UT    0.250254
OH    1.240530
TX    2.915633
OR    0.185893
dtype: float64

In [13]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-1.855996  1.0  0.0  0.0
-1.507252  0.0  0.0  1.0
-0.329277  0.0  0.0  1.0
-0.298520  1.0  0.0  0.0
-0.266721  0.0  1.0  0.0
-0.131377  0.0  1.0  0.0
-0.079023  1.0  0.0  0.0
-0.005989  0.0  0.0  1.0
 0.173159  0.0  1.0  0.0
 0.239323  0.0  0.0  1.0
 0.359052  1.0  0.0  0.0
 1.059638  0.0  1.0  0.0

In [15]:
#groupby
df = DataFrame({'k1':['a','a','b','b','c'],
               'k2':['one','two','one','two','one'],
               'dataset1': np.random.randn(5),
               'dataset2':np.random.randn(5)})

df

  k1   k2  dataset1  dataset2
0  a  one  0.295662  1.086521
1  a  two  1.898179 -0.914814
2  b  one -0.268064 -0.766057
3  b  two -0.469025  0.000131
4  c  one -0.191800  0.166953

In [16]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [17]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [19]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [20]:
df

  k1   k2  dataset1  dataset2
0  a  one  0.295662  1.086521
1  a  two  1.898179 -0.914814
2  b  one -0.268064 -0.766057
3  b  two -0.469025  0.000131
4  c  one -0.191800  0.166953

In [21]:
df['dataset1'].groupby(df['k1']).mean()

k1
a    1.096920
b   -0.368545
c   -0.191800
Name: dataset1, dtype: float64

In [22]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a   1.096920  0.085854
b  -0.368545 -0.382963
c  -0.191800  0.166953

In [23]:
df.groupby(['k1','k2']).mean()

        dataset1  dataset2
k1 k2
a  one  0.295662  1.086521
   two  1.898179 -0.914814
b  one -0.268064 -0.766057
   two -0.469025  0.000131
c  one -0.191800  0.166953

In [27]:
group = df.groupby(['k1','k2'])[['dataset1']]

group.mean()

        dataset1
k1 k2
a  one  0.295662
   two  1.898179
b  one -0.268064
   two -0.469025
c  one -0.191800